In [16]:
from datetime import datetime
import pandas as pd
import numpy as np

In [22]:
df = pd.DataFrame(pd.read_csv('../Data/tags.csv'))

In [23]:
df2 = pd.DataFrame(pd.read_csv('../Data/reviews.csv'))

In [24]:
df.head(5)

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [25]:
df2.head(5)

,id,title,rating,text,movieId,timestamp,date,userId
0,caaa367f-f88d-4011-b7cd-1ee9419a54d5,NaN,4.0,Blank,1,964982703,2000-07-30,1
1,2492be8a-927b-41b6-a665-80d6c5db86eb,NaN,4.0,Blank,3,964981247,2000-07-30,1
2,7a2b2887-76a1-4945-964d-1bd8d246fc5d,NaN,4.0,Blank,6,964982224,2000-07-30,1
3,2b19881e-ba46-458e-85b2-8c02e5d7ad17,NaN,5.0,Blank,47,964983815,2000-07-30,1
4,c6bbf4c1-955e-4f17-bce6-d0b576c39b2f,NaN,5.0,Blank,50,964982931,2000-07-30,1

In [26]:
new_df = pd.merge(df, df2,  how='left', left_on=['movieId','userId'], right_on = ['movieId','userId'])

In [29]:
new_df = new_df.drop(new_df.columns[[3, 5, 6, 7, 8, 9]], axis=1)

In [31]:
new_df = new_df.dropna(subset=['id'])

In [32]:
df.to_csv('../Data/tags.csv', index=False)